app/controllers/courses_controller.rb

SELECT * FROM `courses`
---
  def index
    page = params[:page] || 1
    @courses = Course.all.paginate :page => page, :order => 'name'

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
---
  def show
    @course = Course.find(params[:id])

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO `courses` (`name`, `address`, `length_blue`, `created_at`, `updated_at`, `handicap`, `length_yellow`, `length_red`, `enabled`, `length_white`) VALUES('What the fuck?', 'What the hell?', NULL, '2009-08-19 16:33:01', '2009-08-19 16:33:01', 1000, NULL, NULL, 1, NULL)
---
  def create
    @course = Course.new(params[:course])

    if @course.save

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
UPDATE `courses` SET `updated_at` = '2009-08-19 16:31:38', `address` = 'Carretera Burgos km.27' WHERE `id` = 1
---
  def update
    @course = Course.find(params[:id])

    if @course.update_attributes(params[:course])

SELECT * FROM `courses` WHERE (`courses`.`id` = 3)
DELETE FROM `courses` WHERE `id` = 3
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy