app/controllers/matches_controller.rb

  def new
    @match = Match.new
    @player = @match.players.build if @match.players.empty?

    # La carga de estas colecciones se hacen para cargar los despleglables
    @courses = Course.all
    @tees = Tee.all
    @users = User.all
---
SELECT * FROM `users`