app/controllers/matches_controller.rb

  def index

    @page = params[:page]
    @course_filter = course_condition(params[:find_course_value])
    @course_filter_name = Course.find(@course_filter).name unless @course_filter.blank?
    #@course_filter = params[:find_course] ? 'course_id=' + params[:find_course].to_s() : 'not course_id is null'

    init_query
    @matches = Match.my_matches(session[:user_id],@ordering,@limits,@course_filter)

    @checked['index'] = " checked='1'"
    @params = params

    #order_result
    @records = @matches.length
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `matches`

  def show
    @match = Match.find(params[:id])
    @players = Player.find_all_by_match_id(params[:id])
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 1) LIMIT 1
SELECT * FROM `players` WHERE (`players`.`match_id` IS NULL)

  def new
    @match = Match.new
    @player = @match.players.build if @match.players.empty?

    # La carga de estas colecciones se hacen para cargar los despleglables
    @courses = Course.all.sort {|a,b| a.name <=> b.name}
    @tees = Tee.all.sort {|a,b| a.barras <=> b.barras}
---
SELECT * FROM `players`
SELECT * FROM `courses`
SELECT * FROM `tees`

  def edit
    @match = Match.find(params[:id])

    @courses = Course.all.sort {|a,b| a.name<=>b.name}
    @tees = Tee.all.sort {|a,b| a.barras<=>b.barras}
    @users = User.all
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 5)
SELECT * FROM `courses`
SELECT * FROM `tees`
SELECT * FROM `users`

  def create
    @match = Match.new(params[:match])

    if @match.save
---
INSERT INTO `matches` (`holes`, `created_at`, `updated_at`, `enabled`, `date_hour_match`, `course_id`) VALUES(18, '2009-08-09 18:08:53', '2009-08-09 18:08:53', 1, '2009-08-05 09:34:00', NULL)

  def update
    @match = Match.find(params[:id])

    if @match.update_attributes(params[:match])
      flash[:notice] = 'Match was successfully updated.'
      #render :action => "edit"
      redirect_to(edit_match_path(@match))
    else
      @match.players.build if @match.players.empty?
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 4)
SELECT * FROM `players` WHERE (`players`.match_id = 4)

  def destroy
    @match = Match.find(params[:id])
    @match.destroy
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 5)
DELETE FROM `matches` WHERE `id` = 5