app/controllers/players_controller.rb

  def index
<<<<<<< HEAD:app/controllers/players_controller.rb
    @players = Player.all

    respond_to do |format|
      format.html # index.html.erb
      format.xml { render :xml => @players }
=======
    if params[:match_id] then
      @players = Player.find_all_by_match_id(params[:match_id])
    else
      @players = Player.find(:all, :include => :match, :order => 'LOWER(matches.date_hour_match) DESC')
---
SELECT * FROM `players`
SELECT * FROM `matches` WHERE (`matches`.`id` = 1)

  def show
    @player = Player.find(params[:id])
---
SELECT * FROM `players` WHERE (`players`.`id` = 1)

  def new
    @match = Match.find(params[:match_id])
    @player = Player.new

    @users = User.all
    @numusers = @users.length
    @users.map!{|user| [user.name, user.id]}

    @tees = Tee.all
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 1)
SELECT * FROM `users`
SELECT * FROM `tees`

  def edit
    @player = Player.find(params[:id])
---
SELECT * FROM `players` WHERE (`players`.`id` = 2)

  def create
    @player = Player.new(params[:player])
<<<<<<< HEAD:app/controllers/players_controller.rb
---
INSERT INTO `players` (`name`, `created_at`, `updated_at`, `handicap`, `enabled`, `login`, `password`, `email`) VALUES('Eladio', '2009-08-08 19:10:27', '2009-08-08 19:10:27', 36, 1, 'eladioruiz', 'caraculo', 'eladioruiz@gmail.com')