app/controllers/tees_controller.rb

  def index
    @tees = Tee.all
---
SELECT * FROM `tees`

  def show
    @tee = Tee.find(params[:id])
---
SELECT * FROM `tees` WHERE (`tees`.`id` = 1)

  def edit
    @tee = Tee.find(params[:id])
---
SELECT * FROM `tees` WHERE (`tees`.`id` = 5)

  def create
    @tee = Tee.new(params[:tee])

    respond_to do |format|
      if @tee.save
---
INSERT INTO `tees` (`created_at`, `updated_at`, `enabled`, `barras`) VALUES('2009-08-08 19:24:36', '2009-08-08 19:24:36', 1, 'ROjas')

  def update
    @tee = Tee.find(params[:id])

    respond_to do |format|
      if @tee.update_attributes(params[:tee])
---
SELECT * FROM `tees` WHERE (`tees`.`id` = 5)
UPDATE `tees` SET `updated_at` = '2009-08-22 08:25:12', `barras` = 'asdverdes' WHERE `id` = 5

  def destroy
    @tee = Tee.find(params[:id])
    @tee.destroy
---
SELECT * FROM `tees` WHERE (`tees`.`id` = 1)
DELETE FROM `tees` WHERE `id` = 1