app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    page = params[:page] || 1
    #@posts = Post.paginate_by_board_id @board.id, :page => page, :order => 'updated_at DESC'
    @users = User.paginate :page => page, :order => 'id DESC'

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `handicap`, `enabled`, `login`, `password`, `email`) VALUES('Eladio', '2009-08-19 19:44:34', '2009-08-19 19:44:34', 36, 1, 'eladioruiz', 'caraculo', 'eladioruiz@gmail.com')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `updated_at` = '2009-08-22 08:26:29', `login` = 'jipalbarellos', `email` = 'jipalbarellos@hotmail.com', `password` = 'jipalbarellos' WHERE `id` = 3
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])